Revit 2027 API
BuiltInFailures.DuctFailures.CannotCreateGeometryForDuct Property
 Cannot create geometry for flex duct. The flex duct is intersecting itself or the start and end are too close together.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateGeometryForDuct { get; }
Public Shared ReadOnly Property CannotCreateGeometryForDuct As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateGeometryForDuct {
	FailureDefinitionId^ get ();
}
static member CannotCreateGeometryForDuct : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DuctFailures Class
Autodesk.Revit.DB Namespace